lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_time.c
    for (uint8_t attempt = 0U; attempt < 2U; ++attempt) {
        const uint64_t wakeTimestamp = readGrtcCounterUs(grtc) + wakeDelayUs;
        armSystemOffWakeCompare(grtc, wakeChannel, wakeTimestamp);
        waitForSystemOffWakeLatch();

        if (grtc->EVENTS_COMPARE[wakeChannel] == 0U) {
            return;
        }

        const uint64_t now = readGrtcCounterUs(grtc);
        if (wakeTimestamp > now) {
            grtc->EVENTS_COMPARE[wakeChannel] = 0U;
            return;
        }

        wakeDelayUs += minimumLatencyUs;
    }
}

static void enterTimedSystemOff(bool disableRamRetention, uint32_t delayUs)
{
    programSystemOffWakeUs(delayUs);
    nrf54l15_core_prepare_system_off();
    if (disableRamRetention) {
        nrf54l15_core_disable_system_off_retention();
    }

    __asm volatile("cpsid i" ::: "memory");
    __asm volatile("dsb 0xF" ::: "memory");
    __asm volatile("isb 0xF" ::: "memory");
    NRF_RESET->RESETREAS = 0xFFFFFFFFUL;
    __asm volatile("dsb 0xF" ::: "memory");

    NRF_REGULATORS->SYSTEMOFF = REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter;
    __asm volatile("dsb 0xF" ::: "memory");
    while (true) {
        __asm volatile("wfe");
    }
}

void __attribute__((weak)) SysTick_Handler(void)
{
    ++g_millis_ticks;
}

void initSysTick(void)
{
    SystemCoreClockUpdate();

    uint32_t ticks = SystemCoreClock / 1000UL;
    if (ticks == 0UL) {
        ticks = 64000UL;
    }

    SysTick->CTRL = 0;
    SysTick->LOAD = ticks - 1UL;
    SysTick->VAL = 0UL;
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                    SysTick_CTRL_TICKINT_Msk |
                    SysTick_CTRL_ENABLE_Msk;
}

unsigned long millis(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    return (unsigned long)(nrf54l15_core_monotonic_time_us() / 1000ULL);
#else
    return (unsigned long)g_millis_ticks;
#endif
}

unsigned long micros(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    return (unsigned long)nrf54l15_core_monotonic_time_us();
#else
    uint32_t ms_a;
    uint32_t ms_b;
    uint32_t val;
    uint32_t load;

    do {
        ms_a = g_millis_ticks;
        val = SysTick->VAL;
        ms_b = g_millis_ticks;
    } while (ms_a != ms_b);

    load = SysTick->LOAD + 1UL;
    uint32_t elapsed = load - val;
    uint32_t cycles_per_us = (SystemCoreClock == 0UL) ? 64UL : (SystemCoreClock / 1000000UL);
    if (cycles_per_us == 0UL) {
        cycles_per_us = 64UL;
    }

    return (unsigned long)(ms_a * 1000UL + (elapsed / cycles_per_us));
#endif
}

uint64_t nrf54l15_core_monotonic_time_us(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    initLowPowerTimebase();
    const uint64_t nowUs = readLowPowerCounterUs();
    if (g_low_power_monotonic_origin_valid == 0U) {
        g_low_power_monotonic_origin_us = nowUs;
        g_low_power_monotonic_origin_valid = 1U;
        return 0ULL;
    }
    return nowUs - g_low_power_monotonic_origin_us;
#else
    return (uint64_t)micros();
#endif
}

uint32_t nrf54l15_core_monotonic_time_ms(void)
{
    return (uint32_t)(nrf54l15_core_monotonic_time_us() / 1000ULL);
}

void delay(unsigned long ms)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

    xiao_nrf54l15_board_state_t boardState;
    const uint8_t boardStateActive =
        delayAutoBoardStateEnabled() ? delayBoardStateEnter(&boardState) : 0U;
    initLowPowerTimebase();
    // Keep plain delay() Arduino-compatible for user-held settle rails such as
    // VBAT_EN and IMU_MIC_EN while still collapsing XIAO RF_SW for low idle
    // current. BLE paths that need RF_SW during radio events should use the
    // BoardControl/BleRadio helpers rather than holding it through delay().
    // On XIAO, auto-collapse only when the USB bridge UART is idle. That keeps
    // plain delay() low-current for idle sketches while avoiding garbling
    // active bridge-backed Serial sessions.
    const uint64_t targetUs = readLowPowerCounterUs() + ((uint64_t)ms * 1000ULL);
    delayUntilLowPowerCounterUs(targetUs);
    delayBoardStateExit(&boardState, boardStateActive);
#else
    const unsigned long start = millis();
    while ((millis() - start) < ms) {
        nrf54l15_clean_idle_service();
        __NOP();
    }
#endif
}

void delayLowPowerIdle(unsigned long ms)
{
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

    xiao_nrf54l15_board_state_t boardState;
    const uint8_t boardStateActive = delayBoardStateEnter(&boardState);

#if defined(NRF54L15_CLEAN_POWER_LOW)
    initLowPowerTimebase();
    const uint64_t targetUs = readLowPowerCounterUs() + ((uint64_t)ms * 1000ULL);
    delayUntilLowPowerCounterUs(targetUs);
#else
    const unsigned long start = millis();
    while ((millis() - start) < ms) {
        nrf54l15_clean_idle_service();
        if ((__get_PRIMASK() & 1U) != 0U) {
            __NOP();
            continue;
        }

        const uint32_t restoreRaw = beginIdleSleep();
        __asm volatile("wfi");
        endIdleSleep(restoreRaw);
    }
#endif

    delayBoardStateExit(&boardState, boardStateActive);
}

void delaySystemOff(unsigned long ms)
{
    uint32_t delayUs = (uint32_t)ms;
    if (delayUs > (0xFFFFFFFFUL / 1000UL)) {
        delayUs = 0xFFFFFFFFUL / 1000UL;
    }
    enterTimedSystemOff(false, delayUs * 1000UL);
}

void delaySystemOffNoRetention(unsigned long ms)
{
    uint32_t delayUs = (uint32_t)ms;
    if (delayUs > (0xFFFFFFFFUL / 1000UL)) {
        delayUs = 0xFFFFFFFFUL / 1000UL;
    }
    enterTimedSystemOff(true, delayUs * 1000UL);
}

void delayMicroseconds(unsigned int us)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    // Keep short timing waits busy/precise. Connected BLE paths can opt long
    // waits into tickless idle so 1 ms marker/settle delays do not burn CPU.
    if ((uint32_t)us >= kLowPowerMicroDelaySleepThresholdUs &&
        g_low_power_micro_delay_active == 0U &&
        nrf54l15_clean_low_power_micro_delay_sleep_allowed != 0 &&
        nrf54l15_clean_low_power_micro_delay_sleep_allowed() != 0U &&
        (__get_PRIMASK() & 1U) == 0U &&
        __get_IPSR() == 0U) {
        xiao_nrf54l15_board_state_t boardState;
        g_low_power_micro_delay_active = 1U;
        const uint8_t boardStateActive =
            delayAutoBoardStateEnabled() ? delayBoardStateEnter(&boardState) : 0U;
        initLowPowerTimebase();
        const uint64_t targetUs =
            readLowPowerCounterUs() + (uint64_t)((uint32_t)us);
        delayUntilLowPowerCounterUs(targetUs);
        delayBoardStateExit(&boardState, boardStateActive);
        g_low_power_micro_delay_active = 0U;
        return;
    }
#endif

    const unsigned long start = micros();
    while ((micros() - start) < (unsigned long)us) {
        __NOP();
    }
}

void nrf54l15_core_prepare_system_off(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (g_low_power_timebase_initialized != 0U) {
        if (g_low_power_delay_channel != kLowPowerDelayInvalidChannel) {
            NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
                (1UL << g_low_power_delay_channel);
            g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
                (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
            g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
        }
        NVIC_DisableIRQ(kLowPowerTickIrq);
        NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
            (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
    }
#endif

    clearSystemOffVprRetention();
#if defined(ARDUINO_XIAO_NRF54L15) || defined(ARDUINO_XIAO_NRF54L15_CLEAN)
    xiaoNrf54l15EnterLowestPowerBoardState();
#endif
    SysTick->CTRL = 0U;
}

void nrf54l15_core_disable_system_off_retention(void)
{
    disableSystemOffRetention();
}
